app/controllers/documents_controller.rb

  def status
    docs = Document.accessible(current_account, current_organization).all(:conditions => {:id => params[:ids]})
---
SELECT "documents".* FROM "documents" left outer join